## Plan Result (ptl-jenkins)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 3 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_key_vault.jenkinskv
* Replace
  * azurerm_key_vault_secret.db_password
  * azurerm_key_vault_secret.db_username




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.jenkinskv will be created
  + resource "azurerm_key_vault" "jenkinskv" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "uksouth"
      + name                            = "cftptl-intsvc"
      + public_network_access_enabled   = true
      + purge_protection_enabled        = true
      + resource_group_name             = "core-infra-intsvc-rg"
      + sku_name                        = "standard"
      + soft_delete_retention_days      = 90
      + tags                            = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/cft-jenkins-infrastructure"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
      + vault_uri                       = (known after apply)
    }

  # azurerm_key_vault_secret.db_password must be replaced
-/+ resource "azurerm_key_vault_secret" "db_password" {
      ~ id                      = "https://cftptl-intsvc.vault.azure.net/secrets/pact-db-password/20fcdbbcc7b84a86a71a371c4e8ee3e4" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc" # forces replacement -> (known after apply) # forces replacement
        name                    = "pact-db-password"
      ~ resource_id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc/secrets/pact-db-password/versions/20fcdbbcc7b84a86a71a371c4e8ee3e4" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc/secrets/pact-db-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "71499d5a2ec24edfb5f07bbb4b732dcf" -> (known after apply)
      ~ versionless_id          = "https://cftptl-intsvc.vault.azure.net/secrets/pact-db-password" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

  # azurerm_key_vault_secret.db_username must be replaced
-/+ resource "azurerm_key_vault_secret" "db_username" {
      ~ id                      = "https://cftptl-intsvc.vault.azure.net/secrets/pact-db-user/79c5ddee7d5c4abc9c0e2708a527899d" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc" # forces replacement -> (known after apply) # forces replacement
        name                    = "pact-db-user"
      ~ resource_id             = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc/secrets/pact-db-user/versions/79c5ddee7d5c4abc9c0e2708a527899d" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.KeyVault/vaults/cftptl-intsvc/secrets/pact-db-user" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "4a8468e3d8ed458691eeacbc242c7b05" -> (known after apply)
      ~ versionless_id          = "https://cftptl-intsvc.vault.azure.net/secrets/pact-db-user" -> (known after apply)
        # (1 unchanged attribute hidden)

      - timeouts {}
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Target":"ptl-jenkins","Vars":{}} -->